Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.module.minio.kubernetes_manifest.minio-ingress will be updated in-place
~ resource "kubernetes_manifest" "minio-ingress" {
      ~ manifest = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind        = "Rule"
                        match       = "PathPrefix(`/minio`)"
                        middlewares = [
                            {
                                name = "stripprefix-minio"
                            },
                        ]
                        services    = [
                            {
                                name = "minio"
                                port = 9001
                            },
                        ]
                    },
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/minio-server`)"
                      + middlewares = [
                          + {
                              + name = "stripprefix-minio"
                            },
                        ]
                      + services    = [
                          + {
                              + name = "minio"
                              + port = 9000
                            },
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind        = "Rule"
                        match       = "PathPrefix(`/minio`)"
                        middlewares = [
                            {
                                name      = "stripprefix-minio"
                                namespace = null
                            },
                        ]
                        priority    = null
                        services    = [
                            {
                                kind               = null
                                name               = "minio"
                                namespace          = null
                                nativeLB           = null
                                passHostHeader     = null
                                port               = "9001"
                                responseForwarding = {
                                    flushInterval = null
                                }
                                scheme             = null
                                serversTransport   = null
                                sticky             = {
                                    cookie = {
                                        httpOnly = null
                                        name     = null
                                        sameSite = null
                                        secure   = null
                                    }
                                }
                                strategy           = null
                                weight             = null
                            },
                        ]
                    },
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/minio-server`)"
                      + middlewares = [
                          + {
                              + name      = "stripprefix-minio"
                              + namespace = (known after apply)
                            },
                        ]
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = (known after apply)
                              + name               = "minio"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "9000"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = (known after apply)
                              + serversTransport   = (known after apply)
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
                # (2 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`